
// 天干
export const TIANGAN = ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"]
// 地支
export const DIZHI = ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"]
export const WUXING = ["", "木","火","土","金","水"]
// 支藏干
export  const ZHICANGGAN = {
  "子" : ["癸"],
  "丑" : ["癸","己","辛"],
  "寅" : ["丙","甲","戊"],
  "卯" : ["乙"],
  "辰" : ["乙","戊","癸"],
  "巳" : ["戊","丙","庚"],
  "午" : ["丁","己",""],
  "未" : ["乙","己","丁"],
  "申" : ["戊","庚","壬"],
  "酉" : ["辛"],
  "戌" : ["辛","戊","丁"],
  "亥" : ["壬","甲"],
}

// 十神 ，日干对其他天干 
const SHISHEN = {
  "" : {}
}